trade_exp/src/Catalogs/Альтерра_НастройкиОбменаБитрикс/Альтерра_НастройкиОбменаБитрикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0dc9ff5f-2ffc-4bde-b4a5-5d621ea722fc">
  <name>Альтерра_НастройкиОбменаБитрикс</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="686ac427-0e1e-447e-a4ed-8719455cf1f0">
    <name>ИдПапкиСФайлами</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="141f5cbc-430b-44df-b95e-6f96478e7534">
    <name>ЗначенияСписковДляОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5d0eab30-8f11-4ffa-bf92-878c6a45e155">
      <name>ИдПоляСпискаВБитриксе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c6d86706-5e15-4184-a2b6-6db9770197de">
      <name>Объект1С</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="610b9995-1524-4d96-8c79-f7d7aec0fb88">
      <name>Идентификатор</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="1e2e52d1-5e2d-4318-864e-7cda1932742e">
    <name>РеквизитыТипаСписок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="22504fce-c58c-4885-8aaa-63e591f69851">
      <name>ИдПоля</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>15</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d174b8e4-bb18-4a4d-8482-375917e36129">
      <name>НаименованиеПоляБитрикс</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/Альтерра_НастройкиОбменаБитрикс/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьТаблицуИдентификаторов(МассивОбъектов, Код, ПолучатьИДПапкиСФайлами = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Альтерра_НастройкиОбменаБитриксЗначенияСписковДляОбъекта.Объект1С КАК Объект,
		|	Альтерра_НастройкиОбменаБитриксЗначенияСписковДляОбъекта.Идентификатор КАК Идентификатор
		|ИЗ
		|	Справочник.Альтерра_НастройкиОбменаБитрикс.ЗначенияСписковДляОбъекта КАК Альтерра_НастройкиОбменаБитриксЗначенияСписковДляОбъекта
		|ГДЕ
		|	Альтерра_НастройкиОбменаБитриксЗначенияСписковДляОбъекта.Ссылка.Код = &Код
		|	И Альтерра_НастройкиОбменаБитриксЗначенияСписковДляОбъекта.Объект1С В(&МассивОбъектов)";
	
	Если ПолучатьИДПапкиСФайлами Тогда
		Запрос.Текст = Запрос.Текст + 
		"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Ид папки с файлами"",
		|	Альтерра_НастройкиОбменаБитрикс.ИдПапкиСФайлами
		|ИЗ
		|	Справочник.Альтерра_НастройкиОбменаБитрикс КАК Альтерра_НастройкиОбменаБитрикс
		|ГДЕ
		|	Альтерра_НастройкиОбменаБитрикс.Код = &Код";	
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
		
КонецФункции

#КонецЕсли
